released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "smbus_slave_core.h"

/*_____ D E C L A R A T I O N S ____________________________________________*/

typedef enum
{
    SMBUS_PROTOCOL_NONE = 0,
    SMBUS_PROTOCOL_READ,
    SMBUS_PROTOCOL_BLOCK_WRITE,
    SMBUS_PROTOCOL_WRITE_BYTE,
    SMBUS_PROTOCOL_WRITE_WORD,
    SMBUS_PROTOCOL_SEND_BYTE,
    SMBUS_PROTOCOL_PROCESS_CALL,
    SMBUS_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL,
    SMBUS_PROTOCOL_UBM_CONTROLLER_READ,
    SMBUS_PROTOCOL_UBM_CONTROLLER_WRITE
} SMBUS_PROTOCOL_T;

/*_____ D E F I N I T I O N S ______________________________________________*/

#define SMBUS_EVENT_TIMEOUT                  (0x01U)
#define SMBUS_EVENT_BUS_ERROR                (0x02U)
#define SMBUS_EVENT_PEC_ERROR                (0x04U)
#define SMBUS_EVENT_UNSUPPORTED              (0x08U)
#define SMBUS_EVENT_WRITE_DONE               (0x10U)
#define SMBUS_EVENT_RECOVERED                (0x20U)
#if SMBUS_DEBUG_ENABLE
#define SMBUS_EVENT_DEBUG_RX                 (0x40U)
#define SMBUS_EVENT_DEBUG_TX                 (0x80U)
#endif

#define SMBUS_STATUS_WORD_CML                (0x0002U)

#if SMBUS_DEBUG_ENABLE
#define SMBUS_DEBUG_PROTOCOL_NONE            (0U)
#define SMBUS_DEBUG_PROTOCOL_SEND_BYTE       (1U)
#define SMBUS_DEBUG_PROTOCOL_WRITE_BYTE      (2U)
#define SMBUS_DEBUG_PROTOCOL_WRITE_WORD      (3U)
#define SMBUS_DEBUG_PROTOCOL_READ_BYTE       (4U)
#define SMBUS_DEBUG_PROTOCOL_READ_WORD       (5U)
#define SMBUS_DEBUG_PROTOCOL_RECEIVE_BYTE    (6U)
#define SMBUS_DEBUG_PROTOCOL_BLOCK_WRITE     (7U)
#define SMBUS_DEBUG_PROTOCOL_BLOCK_READ      (8U)
#define SMBUS_DEBUG_PROTOCOL_PROCESS_CALL    (9U)
#define SMBUS_DEBUG_PROTOCOL_BLOCK_PROC_CALL (10U)
#define SMBUS_DEBUG_PROTOCOL_UBM_READ        (11U)
#define SMBUS_DEBUG_PROTOCOL_UBM_WRITE       (12U)
#endif

/*_____ M A C R O S ________________________________________________________*/

#define SMBUS_ADDRESS_WRITE(addr7)           ((uint8_t)((addr7) << 1U))
#define SMBUS_ADDRESS_READ(addr7)            ((uint8_t)(((addr7) << 1U) | 0x01U))

/*_____ F U N C T I O N S __________________________________________________*/

static void smbus_enqueue_write_done_event(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command, uint8_t status)
{
    uint8_t next_head;
    uint8_t next_tail;

    ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_WRITE_DONE);
    ctx->write_done_command_queue[ctx->write_done_head] = command;
    ctx->write_done_status_queue[ctx->write_done_head] = status;

    next_head = (uint8_t)(ctx->write_done_head + 1U);
    if (next_head >= SMBUS_WRITE_DONE_QUEUE_SIZE)
    {
        next_head = 0U;
    }

    if (ctx->write_done_count >= SMBUS_WRITE_DONE_QUEUE_SIZE)
    {
        next_tail = (uint8_t)(ctx->write_done_tail + 1U);
        if (next_tail >= SMBUS_WRITE_DONE_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->write_done_tail = next_tail;
        if (ctx->write_done_dropped < 0xFFU)
        {
            ctx->write_done_dropped = (uint8_t)(ctx->write_done_dropped + 1U);
        }
    }
    else
    {
        ctx->write_done_count = (uint8_t)(ctx->write_done_count + 1U);
    }

    ctx->write_done_head = next_head;
}

static void smbus_set_event(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t event_id, uint8_t command, uint8_t status)
{
    if (event_id == SMBUS_EVENT_WRITE_DONE)
    {
        smbus_enqueue_write_done_event(ctx, command, status);
    }
    else
    {
        ctx->event_flags = (uint8_t)(ctx->event_flags | event_id);
        ctx->last_event_command = command;
        ctx->last_event_status = status;
    }
}

static const char *smbus_get_port_name_from_id(uint8_t port_id)
{
    switch (port_id)
    {
        case SMBUS_SLAVE_PORT_I2C1:
            return "I2C1";

        case SMBUS_SLAVE_PORT_I2C0:
            return "I2C0";

        case SMBUS_SLAVE_PORT_USCI0:
            return "USCI0";

        default:
            break;
    }

    return "?";
}

#if SMBUS_DEBUG_ENABLE
static const char *smbus_debug_get_command_name(uint8_t profile, uint8_t command)
{
    const char *generic_name;

    generic_name = SMBusTransaction_GetCommandNameByProfile(profile, command);
    if (generic_name != (const char *)0)
    {
        return generic_name;
    }

    return "UNKNOWN";
}

static const char *smbus_debug_get_protocol_name(uint8_t protocol)
{
    switch (protocol)
    {
        case SMBUS_DEBUG_PROTOCOL_SEND_BYTE:
            return "SEND_BYTE";

        case SMBUS_DEBUG_PROTOCOL_WRITE_BYTE:
            return "WRITE_BYTE";

        case SMBUS_DEBUG_PROTOCOL_WRITE_WORD:
            return "WRITE_WORD";

        case SMBUS_DEBUG_PROTOCOL_READ_BYTE:
            return "READ_BYTE";

        case SMBUS_DEBUG_PROTOCOL_READ_WORD:
            return "READ_WORD";

        case SMBUS_DEBUG_PROTOCOL_RECEIVE_BYTE:
            return "RECEIVE_BYTE";

        case SMBUS_DEBUG_PROTOCOL_BLOCK_WRITE:
            return "BLOCK_WRITE";

        case SMBUS_DEBUG_PROTOCOL_BLOCK_READ:
            return "BLOCK_READ";

        case SMBUS_DEBUG_PROTOCOL_PROCESS_CALL:
            return "PROCESS_CALL";

        case SMBUS_DEBUG_PROTOCOL_BLOCK_PROC_CALL:
            return "BLOCK_WRITE_READ_PROCESS_CALL";

        case SMBUS_DEBUG_PROTOCOL_UBM_READ:
            return "UBM_CONTROLLER_READ";

        case SMBUS_DEBUG_PROTOCOL_UBM_WRITE:
            return "UBM_CONTROLLER_WRITE";

        default:
            break;
    }

    return "UNKNOWN";
}

static uint8_t smbus_debug_read_protocol_from_flags(uint8_t flags)
{
    if ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE) != 0U)
    {
        return SMBUS_DEBUG_PROTOCOL_READ_BYTE;
    }

    if ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_WORD) != 0U)
    {
        return SMBUS_DEBUG_PROTOCOL_READ_WORD;
    }

    if ((flags & SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ) != 0U)
    {
        return SMBUS_DEBUG_PROTOCOL_BLOCK_READ;
    }

    return SMBUS_DEBUG_PROTOCOL_NONE;
}

static uint8_t smbus_debug_protocol_from_core(uint8_t protocol, uint8_t flags)
{
    switch (protocol)
    {
        case SMBUS_PROTOCOL_READ:
            return smbus_debug_read_protocol_from_flags(flags);

        case SMBUS_PROTOCOL_BLOCK_WRITE:
            return SMBUS_DEBUG_PROTOCOL_BLOCK_WRITE;

        case SMBUS_PROTOCOL_WRITE_BYTE:
            return SMBUS_DEBUG_PROTOCOL_WRITE_BYTE;

