released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
        case SMBUS_PROTOCOL_WRITE_WORD:
            return SMBUS_DEBUG_PROTOCOL_WRITE_WORD;

        case SMBUS_PROTOCOL_SEND_BYTE:
            return SMBUS_DEBUG_PROTOCOL_SEND_BYTE;

        case SMBUS_PROTOCOL_PROCESS_CALL:
            return SMBUS_DEBUG_PROTOCOL_PROCESS_CALL;

        case SMBUS_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL:
            return SMBUS_DEBUG_PROTOCOL_BLOCK_PROC_CALL;

        case SMBUS_PROTOCOL_UBM_CONTROLLER_READ:
            return SMBUS_DEBUG_PROTOCOL_UBM_READ;

        case SMBUS_PROTOCOL_UBM_CONTROLLER_WRITE:
            return SMBUS_DEBUG_PROTOCOL_UBM_WRITE;

        default:
            break;
    }

    return SMBUS_DEBUG_PROTOCOL_NONE;
}

static void smbus_debug_capture_rx(SMBUS_SLAVE_CONTEXT_T *ctx,
                                   uint8_t command,
                                   uint8_t raw_length,
                                   uint8_t payload_length,
                                   uint8_t protocol,
                                   uint8_t repeated_start,
                                   uint8_t pec_present,
                                   uint8_t pec_valid)
{
#if SMBUS_DEBUG_PRINT_RX_FRAME
    SMBUS_DEBUG_RX_FRAME_T *record;
    uint8_t index;
    uint8_t capped_length;
    uint8_t next_head;
    uint8_t next_tail;

    capped_length = raw_length;
    if (capped_length > SMBUS_SLAVE_RX_BUFFER_SIZE)
    {
        capped_length = SMBUS_SLAVE_RX_BUFFER_SIZE;
    }

    record = &ctx->debug_rx_queue[ctx->debug_rx_head];
    record->command = command;
    record->profile = SMBusTransaction_GetProfile(&ctx->transaction);
    record->raw_length = capped_length;
    record->payload_length = payload_length;
    record->protocol = protocol;
    record->repeated_start = repeated_start;
    record->pec_present = pec_present;
    record->pec_valid = pec_valid;

    for (index = 0U; index < capped_length; index++)
    {
        record->raw[index] = ctx->rx_buffer[index];
    }

    next_head = (uint8_t)(ctx->debug_rx_head + 1U);
    if (next_head >= SMBUS_DEBUG_FRAME_QUEUE_SIZE)
    {
        next_head = 0U;
    }

    if (ctx->debug_rx_count >= SMBUS_DEBUG_FRAME_QUEUE_SIZE)
    {
        next_tail = (uint8_t)(ctx->debug_rx_tail + 1U);
        if (next_tail >= SMBUS_DEBUG_FRAME_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->debug_rx_tail = next_tail;
        if (ctx->debug_rx_dropped < 0xFFU)
        {
            ctx->debug_rx_dropped = (uint8_t)(ctx->debug_rx_dropped + 1U);
        }
    }
    else
    {
        ctx->debug_rx_count = (uint8_t)(ctx->debug_rx_count + 1U);
    }

    ctx->debug_rx_head = next_head;
    ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_DEBUG_RX);
#else
    ctx = ctx;
    command = command;
    raw_length = raw_length;
    payload_length = payload_length;
    protocol = protocol;
    repeated_start = repeated_start;
    pec_present = pec_present;
    pec_valid = pec_valid;
#endif
}

static void smbus_debug_capture_tx(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command, uint8_t protocol)
{
#if SMBUS_DEBUG_PRINT_TX_READY
    SMBUS_DEBUG_TX_FRAME_T *record;
    uint8_t index;
    uint8_t capped_length;
    uint8_t next_head;
    uint8_t next_tail;

    capped_length = ctx->tx_length;
    if (capped_length > SMBUS_SLAVE_TX_BUFFER_SIZE)
    {
        capped_length = SMBUS_SLAVE_TX_BUFFER_SIZE;
    }

    record = &ctx->debug_tx_queue[ctx->debug_tx_head];
    record->command = command;
    record->profile = SMBusTransaction_GetProfile(&ctx->transaction);
    record->protocol = protocol;
    record->length = capped_length;

    for (index = 0U; index < capped_length; index++)
    {
        record->raw[index] = ctx->tx_buffer[index];
    }

    next_head = (uint8_t)(ctx->debug_tx_head + 1U);
    if (next_head >= SMBUS_DEBUG_TX_QUEUE_SIZE)
    {
        next_head = 0U;
    }

    if (ctx->debug_tx_count >= SMBUS_DEBUG_TX_QUEUE_SIZE)
    {
        next_tail = (uint8_t)(ctx->debug_tx_tail + 1U);
        if (next_tail >= SMBUS_DEBUG_TX_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->debug_tx_tail = next_tail;
        if (ctx->debug_tx_dropped < 0xFFU)
        {
            ctx->debug_tx_dropped = (uint8_t)(ctx->debug_tx_dropped + 1U);
        }
    }
    else
    {
        ctx->debug_tx_count = (uint8_t)(ctx->debug_tx_count + 1U);
    }

    ctx->debug_tx_head = next_head;
    ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_DEBUG_TX);
#else
    ctx = ctx;
    command = command;
    protocol = protocol;
#endif
}

static void smbus_debug_print_raw_bytes(const uint8_t *data, uint8_t length)
{
    uint8_t index;

    for (index = 0U; index < length; index++)
    {
        if (index != 0U)
        {
            printf(" ");
        }
        printf("%02X", (unsigned int)data[index]);
    }
}
#endif

static void smbus_set_ack(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->ack_next = 1U;
}

static void smbus_clear_ack(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->ack_next = 0U;
}

static void smbus_reset_rx(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->rx_length = 0U;
    ctx->pending_read = 0U;
    ctx->command_length_without_pec = 0U;
}

static void smbus_reset_tx(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->tx_length = 0U;
    ctx->tx_index = 0U;
}

#if SMBUS_ENABLE_PEC
static uint8_t smbus_pec_update(uint8_t crc, uint8_t data_byte)
{
    uint8_t bit_index;

    crc = (uint8_t)(crc ^ data_byte);
    for (bit_index = 0U; bit_index < 8U; bit_index++)
    {
        if ((crc & 0x80U) != 0U)
        {
            crc = (uint8_t)((crc << 1) ^ 0x07U);
        }
        else
        {
            crc = (uint8_t)(crc << 1);
        }
    }

    return crc;
}

static uint8_t smbus_compute_write_pec(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t frame_length_without_pec)
{
    uint8_t crc;
    uint8_t index;

    crc = 0U;
    crc = smbus_pec_update(crc, SMBUS_ADDRESS_WRITE(ctx->address_7bit));
    for (index = 0U; index < frame_length_without_pec; index++)
    {
        crc = smbus_pec_update(crc, ctx->rx_buffer[index]);
    }

