released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
    return crc;
}

static void smbus_append_read_pec(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command_length)
{
    uint8_t crc;
    uint8_t index;

    if (ctx->tx_length >= SMBUS_SLAVE_TX_BUFFER_SIZE)
    {
        return;
    }

    crc = 0U;
    crc = smbus_pec_update(crc, SMBUS_ADDRESS_WRITE(ctx->address_7bit));
    for (index = 0U; index < command_length; index++)
    {
        crc = smbus_pec_update(crc, ctx->rx_buffer[index]);
    }

    crc = smbus_pec_update(crc, SMBUS_ADDRESS_READ(ctx->address_7bit));
    for (index = 0U; index < ctx->tx_length; index++)
    {
        crc = smbus_pec_update(crc, ctx->tx_buffer[index]);
    }

    ctx->tx_buffer[ctx->tx_length] = crc;
    ctx->tx_length = (uint8_t)(ctx->tx_length + 1U);
}

static void smbus_append_receive_byte_pec(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    uint8_t crc;
    uint8_t index;

    if (ctx->tx_length >= SMBUS_SLAVE_TX_BUFFER_SIZE)
    {
        return;
    }

    crc = 0U;
    crc = smbus_pec_update(crc, SMBUS_ADDRESS_READ(ctx->address_7bit));
    for (index = 0U; index < ctx->tx_length; index++)
    {
        crc = smbus_pec_update(crc, ctx->tx_buffer[index]);
    }

    ctx->tx_buffer[ctx->tx_length] = crc;
    ctx->tx_length = (uint8_t)(ctx->tx_length + 1U);
}
#endif

static uint8_t smbus_get_builtin_command_flags(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command)
{
    if (SMBusTransaction_GetProfile(&ctx->transaction) == SMBUS_SLAVE_COMMAND_PROFILE_UBM_CONTROLLER)
    {
        return 0U;
    }

    return SMBusTransaction_GetCommandFlags(command);
}

static uint8_t smbus_get_command_flags(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command)
{
    uint8_t flags;
    uint8_t user_flags;

    flags = smbus_get_builtin_command_flags(ctx, command);
    user_flags = 0U;
    if (SMBusSlave_UserGetCommandFlags(ctx->port_id, command, &user_flags) != 0U)
    {
        flags = (uint8_t)(flags | user_flags);
    }

    return flags;
}

static uint8_t smbus_length_matches_protocol(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t flags, uint8_t length, uint8_t *protocol)
{
    uint8_t count;
    uint8_t profile_protocol;
    uint8_t data_len;

    *protocol = (uint8_t)SMBUS_PROTOCOL_NONE;

    if (length > 0U)
    {
        data_len = (uint8_t)(length - 1U);
        profile_protocol = (uint8_t)SMBusTransaction_DetectProfileProtocol(&ctx->transaction,
                                                                           ctx->rx_buffer[0],
                                                                           data_len,
                                                                           1U);
        if (profile_protocol == (uint8_t)SMBUS_TRANSACTION_PROTOCOL_UBM_CONTROLLER_READ)
        {
            *protocol = (uint8_t)SMBUS_PROTOCOL_UBM_CONTROLLER_READ;
            return 1U;
        }

        profile_protocol = (uint8_t)SMBusTransaction_DetectProfileProtocol(&ctx->transaction,
                                                                           ctx->rx_buffer[0],
                                                                           data_len,
                                                                           0U);
        if (profile_protocol == (uint8_t)SMBUS_TRANSACTION_PROTOCOL_UBM_CONTROLLER_WRITE)
        {
            *protocol = (uint8_t)SMBUS_PROTOCOL_UBM_CONTROLLER_WRITE;
            return 1U;
        }
    }

    if ((length == 3U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_PROCESS_CALL) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_PROCESS_CALL;
        return 1U;
    }

    if ((length >= 2U) &&
        (SMBusTransaction_IsBlockWriteReadProcessCallCommand(ctx->rx_buffer[0]) != 0U))
    {
        count = ctx->rx_buffer[1];
        if ((count <= SMBUS_SLAVE_MAX_BLOCK_SIZE) &&
            (length == (uint8_t)(count + 2U)))
        {
            *protocol = (uint8_t)SMBUS_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL;
            return 1U;
        }
    }

    if ((length == 1U) &&
        ((flags & (SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE |
                   SMBUS_SLAVE_COMMAND_FLAG_READ_WORD |
                   SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ)) != 0U) &&
        (SMBusTransaction_IsProcessCallCommand(ctx->rx_buffer[0]) == 0U) &&
        (SMBusTransaction_IsBlockWriteReadProcessCallCommand(ctx->rx_buffer[0]) == 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_READ;
        return 1U;
    }

    if ((length == 1U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_SEND_BYTE) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_SEND_BYTE;
        return 1U;
    }

    if ((length == 2U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_WRITE_BYTE) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_WRITE_BYTE;
        return 1U;
    }

    if ((length == 3U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_WRITE_WORD) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_WRITE_WORD;
        return 1U;
    }

    if ((length >= 2U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_BLOCK_WRITE) != 0U))
    {
        count = ctx->rx_buffer[1];
        if ((count <= SMBUS_SLAVE_MAX_BLOCK_SIZE) &&
            (length == (uint8_t)(count + 2U)))
        {
            *protocol = (uint8_t)SMBUS_PROTOCOL_BLOCK_WRITE;
            return 1U;
        }
    }

    return 0U;
}

static uint8_t smbus_select_effective_length(SMBUS_SLAVE_CONTEXT_T *ctx,
                                             uint8_t flags,
                                             uint8_t *effective_length,
                                             uint8_t *pec_present,
                                             uint8_t *pec_valid)
{
#if SMBUS_ENABLE_PEC
    uint8_t candidate_length;
    uint8_t protocol;
    uint8_t protocol_no_pec;
    uint8_t computed_pec;
    uint8_t last_byte;
#else
    flags = flags;
#endif

    *effective_length = ctx->rx_length;
    *pec_present = 0U;
    *pec_valid = 1U;

    if (SMBusTransaction_UsesSmbusPec(&ctx->transaction) == 0U)
    {
        flags = flags;
        return 1U;
    }

#if SMBUS_ENABLE_PEC
    if (ctx->rx_length <= 1U)
    {
#if (SMBUS_PEC_POLICY == SMBUS_PEC_POLICY_REQUIRED)
        if (smbus_length_matches_protocol(ctx, flags, ctx->rx_length, &protocol) != 0U)
        {
            if (protocol != (uint8_t)SMBUS_PROTOCOL_READ)
            {
                *pec_valid = 0U;
                return 0U;
            }
        }
#endif
        return 1U;
    }

    candidate_length = (uint8_t)(ctx->rx_length - 1U);
    if (smbus_length_matches_protocol(ctx, flags, candidate_length, &protocol) != 0U)
    {
        computed_pec = smbus_compute_write_pec(ctx, candidate_length);
        last_byte = ctx->rx_buffer[ctx->rx_length - 1U];
        if (last_byte == computed_pec)
        {
            *effective_length = candidate_length;
            *pec_present = 1U;
            return 1U;
        }

        protocol_no_pec = (uint8_t)SMBUS_PROTOCOL_NONE;
        if ((smbus_length_matches_protocol(ctx, flags, ctx->rx_length, &protocol_no_pec) == 0U) ||
            ((SMBUS_PEC_POLICY == SMBUS_PEC_POLICY_REQUIRED) &&
             (protocol_no_pec != (uint8_t)SMBUS_PROTOCOL_READ)))
        {
            *effective_length = candidate_length;
            *pec_present = 1U;
            *pec_valid = 0U;
            return 0U;
        }
    }

