released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
#if (SMBUS_PEC_POLICY == SMBUS_PEC_POLICY_REQUIRED)
    if (smbus_length_matches_protocol(ctx, flags, ctx->rx_length, &protocol) != 0U)
    {
        if (protocol != (uint8_t)SMBUS_PROTOCOL_READ)
        {
            *pec_valid = 0U;
            return 0U;
        }
    }
#endif
#endif

    return 1U;
}

static void smbus_prepare_error_response(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command, uint8_t status)
{
    ctx->status_word = (uint16_t)(ctx->status_word | SMBUS_STATUS_WORD_CML);
    ctx->tx_buffer[0] = 0x00U;
    ctx->tx_length = 1U;
    ctx->tx_index = 0U;
    smbus_set_event(ctx, SMBUS_EVENT_UNSUPPORTED, command, status);
}

static SMBUS_TRANSACTION_PROTOCOL_T smbus_get_transaction_protocol(uint8_t protocol, uint8_t flags)
{
    switch (protocol)
    {
        case SMBUS_PROTOCOL_READ:
            if ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE) != 0U)
            {
                return SMBUS_TRANSACTION_PROTOCOL_READ_BYTE;
            }
            if ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_WORD) != 0U)
            {
                return SMBUS_TRANSACTION_PROTOCOL_READ_WORD;
            }
            if ((flags & SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ) != 0U)
            {
                return SMBUS_TRANSACTION_PROTOCOL_BLOCK_READ;
            }
            break;

        case SMBUS_PROTOCOL_BLOCK_WRITE:
            return SMBUS_TRANSACTION_PROTOCOL_BLOCK_WRITE;

        case SMBUS_PROTOCOL_WRITE_BYTE:
            return SMBUS_TRANSACTION_PROTOCOL_WRITE_BYTE;

        case SMBUS_PROTOCOL_WRITE_WORD:
            return SMBUS_TRANSACTION_PROTOCOL_WRITE_WORD;

        case SMBUS_PROTOCOL_SEND_BYTE:
            return SMBUS_TRANSACTION_PROTOCOL_SEND_BYTE;

        case SMBUS_PROTOCOL_PROCESS_CALL:
            return SMBUS_TRANSACTION_PROTOCOL_PROCESS_CALL;

        case SMBUS_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL:
            return SMBUS_TRANSACTION_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL;

        case SMBUS_PROTOCOL_UBM_CONTROLLER_READ:
            return SMBUS_TRANSACTION_PROTOCOL_UBM_CONTROLLER_READ;

        case SMBUS_PROTOCOL_UBM_CONTROLLER_WRITE:
            return SMBUS_TRANSACTION_PROTOCOL_UBM_CONTROLLER_WRITE;

        default:
            break;
    }

    return SMBUS_TRANSACTION_PROTOCOL_UNKNOWN;
}

static void smbus_build_transaction(SMBUS_SLAVE_CONTEXT_T *ctx,
                                    uint8_t command,
                                    uint8_t protocol,
                                    uint8_t flags,
                                    uint8_t effective_length,
                                    uint8_t repeated_start,
                                    uint8_t pec_present,
                                    uint8_t pec_valid,
                                    SMBUS_TRANSACTION_T *transaction)
{
    uint8_t payload_length;
    uint8_t index;

    transaction->command = command;
    transaction->address_7bit = ctx->address_7bit;
    transaction->data_len = 0U;
    transaction->repeated_start = repeated_start;
    transaction->pec_present = pec_present;
    transaction->pec_valid = pec_valid;
    transaction->protocol = smbus_get_transaction_protocol(protocol, flags);

    if (effective_length > 1U)
    {
        payload_length = (uint8_t)(effective_length - 1U);
        if (payload_length > (SMBUS_SLAVE_MAX_BLOCK_SIZE + 1U))
        {
            payload_length = (uint8_t)(SMBUS_SLAVE_MAX_BLOCK_SIZE + 1U);
        }
        for (index = 0U; index < payload_length; index++)
        {
            transaction->payload[index] = ctx->rx_buffer[(uint8_t)(index + 1U)];
        }
        transaction->data_len = payload_length;
    }
}

static void smbus_prepare_read_response(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    uint8_t command;
    uint8_t flags;
    uint8_t length;
    uint8_t value;
    uint16_t word_value;
    uint8_t handled;
    uint8_t transaction_tx_length;
    uint8_t read_protocol;
    uint8_t data_len;
    SMBUS_TRANSACTION_T transaction;
#if SMBUS_DEBUG_ENABLE
    uint8_t debug_protocol;
#endif

    command = ctx->rx_buffer[0];
    flags = smbus_get_command_flags(ctx, command);
    ctx->tx_length = 0U;
    ctx->tx_index = 0U;
    handled = 0U;
    transaction_tx_length = 0U;
    read_protocol = (uint8_t)SMBUS_PROTOCOL_READ;
    data_len = 0U;
    if (ctx->command_length_without_pec > 0U)
    {
        data_len = (uint8_t)(ctx->command_length_without_pec - 1U);
    }
    if (SMBusTransaction_DetectProfileProtocol(&ctx->transaction, command, data_len, 1U) ==
        SMBUS_TRANSACTION_PROTOCOL_UBM_CONTROLLER_READ)
    {
        read_protocol = (uint8_t)SMBUS_PROTOCOL_UBM_CONTROLLER_READ;
    }
    else if (SMBusTransaction_IsProcessCallCommand(command) != 0U)
    {
        read_protocol = (uint8_t)SMBUS_PROTOCOL_PROCESS_CALL;
    }
    else if (SMBusTransaction_IsBlockWriteReadProcessCallCommand(command) != 0U)
    {
        read_protocol = (uint8_t)SMBUS_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL;
    }
    else
    {
        read_protocol = (uint8_t)SMBUS_PROTOCOL_READ;
    }
#if SMBUS_DEBUG_ENABLE
    debug_protocol = smbus_debug_protocol_from_core(read_protocol, flags);
#endif

    smbus_build_transaction(ctx,
                            command,
                            read_protocol,
                            flags,
                            ctx->command_length_without_pec,
                            1U,
                            0U,
                            1U,
                            &transaction);
    handled = SMBusTransaction_Execute(&ctx->transaction, &transaction, ctx->tx_buffer, &transaction_tx_length);
    if (handled != 0U)
    {
        ctx->tx_length = transaction_tx_length;
    }

    if ((handled == 0U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE) != 0U))
    {
        if (SMBusSlave_UserReadByte(ctx->port_id, command, &value) != 0U)
        {
            ctx->tx_buffer[0] = value;
            ctx->tx_length = 1U;
            handled = 1U;
        }
    }

    if ((handled == 0U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_WORD) != 0U))
    {
        if (SMBusSlave_UserReadWord(ctx->port_id, command, &word_value) != 0U)
        {
            ctx->tx_buffer[0] = (uint8_t)(word_value & 0x00FFU);
            ctx->tx_buffer[1] = (uint8_t)((word_value >> 8) & 0x00FFU);
            ctx->tx_length = 2U;
            handled = 1U;
        }
    }

