released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
    if ((handled == 0U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ) != 0U))
    {
        length = 0U;
        if (SMBusSlave_UserBlockRead(ctx->port_id, command, &ctx->tx_buffer[1], &length) != 0U)
        {
            if (length > SMBUS_SLAVE_MAX_BLOCK_SIZE)
            {
                length = SMBUS_SLAVE_MAX_BLOCK_SIZE;
            }
            ctx->tx_buffer[0] = length;
            ctx->tx_length = (uint8_t)(length + 1U);
            handled = 1U;
        }
    }

    if (handled == 0U)
    {
        smbus_prepare_error_response(ctx, command, status);
    }
    else
    {
#if SMBUS_ENABLE_PEC
        if (SMBusTransaction_UsesSmbusPec(&ctx->transaction) != 0U)
        {
            smbus_append_read_pec(ctx, ctx->command_length_without_pec);
        }
#endif
    }

#if SMBUS_DEBUG_ENABLE
    smbus_debug_capture_tx(ctx, command, debug_protocol);
#endif
}

static void smbus_prepare_receive_byte_response(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    uint8_t command;
    uint8_t handled;
    uint8_t transaction_tx_length;
    SMBUS_TRANSACTION_T transaction;

    command = SMBusTransaction_GetReceiveByteCommand(&ctx->transaction);
    ctx->tx_length = 0U;
    ctx->tx_index = 0U;
    handled = 0U;
    transaction_tx_length = 0U;

    transaction.command = command;
    transaction.address_7bit = ctx->address_7bit;
    transaction.data_len = 0U;
    transaction.repeated_start = 0U;
    transaction.pec_present = 0U;
    transaction.pec_valid = 1U;
    transaction.protocol = SMBUS_TRANSACTION_PROTOCOL_RECEIVE_BYTE;

    handled = SMBusTransaction_Execute(&ctx->transaction, &transaction, ctx->tx_buffer, &transaction_tx_length);
    if (handled != 0U)
    {
        ctx->tx_length = transaction_tx_length;
    }
    else
    {
        ctx->tx_buffer[0] = 0x00U;
        ctx->tx_length = 1U;
    }

#if SMBUS_ENABLE_PEC
    if (SMBusTransaction_UsesSmbusPec(&ctx->transaction) != 0U)
    {
        smbus_append_receive_byte_pec(ctx);
    }
#endif

#if SMBUS_DEBUG_ENABLE
    smbus_debug_capture_tx(ctx, command, SMBUS_DEBUG_PROTOCOL_RECEIVE_BYTE);
#endif
}

static void smbus_execute_write_protocol(SMBUS_SLAVE_CONTEXT_T *ctx,
                                         uint8_t command,
                                         uint8_t protocol,
                                         uint8_t effective_length,
                                         uint8_t pec_present,
                                         uint8_t pec_valid,
                                         uint8_t status)
{
    uint8_t handled;
    uint8_t count;
    uint8_t transaction_tx_length;
    uint16_t word_value;
    SMBUS_TRANSACTION_T transaction;

    handled = 0U;
    transaction_tx_length = 0U;
    smbus_build_transaction(ctx,
                            command,
                            protocol,
                            smbus_get_command_flags(ctx, command),
                            effective_length,
                            0U,
                            pec_present,
                            pec_valid,
                            &transaction);
    handled = SMBusTransaction_Execute(&ctx->transaction, &transaction, ctx->tx_buffer, &transaction_tx_length);
    if (handled != 0U)
    {
        ctx->tx_length = transaction_tx_length;
    }

    switch (protocol)
    {
        case SMBUS_PROTOCOL_SEND_BYTE:
            if (handled == 0U)
            {
                handled = SMBusSlave_UserSendByte(ctx->port_id, command, pec_present, pec_valid);
            }
            break;

        case SMBUS_PROTOCOL_WRITE_BYTE:
            if (handled == 0U)
            {
                handled = SMBusSlave_UserWriteByte(ctx->port_id, command, ctx->rx_buffer[1], pec_present, pec_valid);
            }
            break;

        case SMBUS_PROTOCOL_WRITE_WORD:
            word_value = ((uint16_t)ctx->rx_buffer[1]) |
                         ((uint16_t)ctx->rx_buffer[2] << 8);
            if (handled == 0U)
            {
                handled = SMBusSlave_UserWriteWord(ctx->port_id, command, word_value, pec_present, pec_valid);
            }
            break;

        case SMBUS_PROTOCOL_BLOCK_WRITE:
            count = ctx->rx_buffer[1];
            if (effective_length == (uint8_t)(count + 2U))
            {
                if (handled == 0U)
                {
                    handled = SMBusSlave_UserBlockWrite(ctx->port_id,
                                                        command,
                                                        &ctx->rx_buffer[2],
                                                        count,
                                                        pec_present,
                                                        pec_valid);
                }
            }
            break;

        default:
            break;
    }

    if (handled == 0U)
    {
        smbus_prepare_error_response(ctx, command, status);
    }
    else
    {
        smbus_set_event(ctx, SMBUS_EVENT_WRITE_DONE, command, status);
    }
}

static void smbus_process_stop_or_restart(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    uint8_t command;
    uint8_t flags;
    uint8_t effective_length;
    uint8_t pec_present;
    uint8_t pec_valid;
    uint8_t protocol;
#if SMBUS_DEBUG_ENABLE
    uint8_t debug_payload_length;
    uint8_t debug_protocol;
    uint8_t debug_repeated_start;
#endif

    if (ctx->rx_length == 0U)
    {
        return;
    }

    command = ctx->rx_buffer[0];
    flags = smbus_get_command_flags(ctx, command);
    if (smbus_select_effective_length(ctx, flags, &effective_length, &pec_present, &pec_valid) == 0U)
    {
#if SMBUS_DEBUG_ENABLE
        debug_payload_length = 0U;
        if (effective_length > 0U)
        {
            debug_payload_length = (uint8_t)(effective_length - 1U);
        }
        smbus_debug_capture_rx(ctx,
                               command,
                               ctx->rx_length,
                               debug_payload_length,
                               SMBUS_DEBUG_PROTOCOL_NONE,
                               0U,
                               pec_present,
                               pec_valid);
#endif
        ctx->status_word = (uint16_t)(ctx->status_word | SMBUS_STATUS_WORD_CML);
        smbus_set_event(ctx, SMBUS_EVENT_PEC_ERROR, command, status);
        smbus_reset_rx(ctx);
        smbus_reset_tx(ctx);
        return;
    }

