released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
    if (smbus_length_matches_protocol(ctx, flags, effective_length, &protocol) == 0U)
    {
#if SMBUS_DEBUG_ENABLE
        debug_payload_length = 0U;
        if (effective_length > 0U)
        {
            debug_payload_length = (uint8_t)(effective_length - 1U);
        }
        smbus_debug_capture_rx(ctx,
                               command,
                               ctx->rx_length,
                               debug_payload_length,
                               SMBUS_DEBUG_PROTOCOL_NONE,
                               0U,
                               pec_present,
                               pec_valid);
#endif
        smbus_prepare_error_response(ctx, command, status);
        smbus_reset_rx(ctx);
        return;
    }

#if SMBUS_DEBUG_ENABLE
    debug_protocol = smbus_debug_protocol_from_core(protocol, flags);
    debug_payload_length = 0U;
    if (effective_length > 0U)
    {
        debug_payload_length = (uint8_t)(effective_length - 1U);
    }
    debug_repeated_start = 0U;
    if (((protocol == (uint8_t)SMBUS_PROTOCOL_READ) && (effective_length == 1U)) ||
        (protocol == (uint8_t)SMBUS_PROTOCOL_PROCESS_CALL) ||
        (protocol == (uint8_t)SMBUS_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL) ||
        (protocol == (uint8_t)SMBUS_PROTOCOL_UBM_CONTROLLER_READ))
    {
        debug_repeated_start = 1U;
    }
    smbus_debug_capture_rx(ctx,
                           command,
                           ctx->rx_length,
                           debug_payload_length,
                           debug_protocol,
                           debug_repeated_start,
                           pec_present,
                           pec_valid);
#endif

    if (((protocol == (uint8_t)SMBUS_PROTOCOL_READ) && (effective_length == 1U)) ||
        (protocol == (uint8_t)SMBUS_PROTOCOL_PROCESS_CALL) ||
        (protocol == (uint8_t)SMBUS_PROTOCOL_BLOCK_WRITE_READ_PROCESS_CALL) ||
        (protocol == (uint8_t)SMBUS_PROTOCOL_UBM_CONTROLLER_READ))
    {
        ctx->pending_read = 1U;
        ctx->command_length_without_pec = effective_length;
        return;
    }

    smbus_execute_write_protocol(ctx, command, protocol, effective_length, pec_present, pec_valid, status);
    smbus_reset_rx(ctx);
}

static uint8_t smbus_load_next_tx_byte(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    uint8_t next_byte;

    if (ctx->tx_index < ctx->tx_length)
    {
        next_byte = ctx->tx_buffer[ctx->tx_index];
        ctx->tx_index = (uint8_t)(ctx->tx_index + 1U);
    }
    else
    {
        next_byte = 0x00U;
    }

    return next_byte;
}

void SMBusSlave_CoreInit(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t port_id, uint8_t address_7bit, const char *port_name)
{
    memset(ctx->rx_buffer, 0, sizeof(ctx->rx_buffer));
    memset(ctx->tx_buffer, 0, sizeof(ctx->tx_buffer));
    SMBusTransaction_Init(&ctx->transaction);

    ctx->rx_length = 0U;
    ctx->tx_length = 0U;
    ctx->tx_index = 0U;
    ctx->pending_read = 0U;
    ctx->command_length_without_pec = 0U;
    ctx->ack_next = 1U;
    ctx->event_flags = 0U;
    ctx->last_event_command = 0U;
    ctx->last_event_status = 0U;
    ctx->write_done_head = 0U;
    ctx->write_done_tail = 0U;
    ctx->write_done_count = 0U;
    ctx->write_done_dropped = 0U;
    ctx->timeout_count = 0U;
    ctx->recover_pending = 0U;
#if SMBUS_DEBUG_ENABLE
    ctx->debug_rx_head = 0U;
    ctx->debug_rx_tail = 0U;
    ctx->debug_rx_count = 0U;
    ctx->debug_rx_dropped = 0U;
    ctx->debug_tx_head = 0U;
    ctx->debug_tx_tail = 0U;
    ctx->debug_tx_count = 0U;
    ctx->debug_tx_dropped = 0U;
    memset(ctx->debug_rx_queue, 0, sizeof(ctx->debug_rx_queue));
    memset(ctx->debug_tx_queue, 0, sizeof(ctx->debug_tx_queue));
#endif
    ctx->status_word = 0U;
    memset(ctx->write_done_command_queue, 0, sizeof(ctx->write_done_command_queue));
    memset(ctx->write_done_status_queue, 0, sizeof(ctx->write_done_status_queue));
    ctx->port_id = port_id;
    ctx->address_7bit = address_7bit;
    ctx->port_name = port_name;
}

void SMBusSlave_CoreResetBus(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    smbus_reset_rx(ctx);
    smbus_reset_tx(ctx);
    smbus_set_ack(ctx);
}

void SMBusSlave_CoreOnAddressWrite(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    smbus_reset_rx(ctx);
    smbus_reset_tx(ctx);
    smbus_set_ack(ctx);
}

void SMBusSlave_CoreOnReceiveByte(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t data)
{
    if (ctx->rx_length < SMBUS_SLAVE_RX_BUFFER_SIZE)
    {
        ctx->rx_buffer[ctx->rx_length] = data;
        ctx->rx_length = (uint8_t)(ctx->rx_length + 1U);
        smbus_set_ack(ctx);
    }
    else
    {
        smbus_clear_ack(ctx);
    }
}

void SMBusSlave_CoreOnReceiveNack(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    smbus_reset_rx(ctx);
    smbus_reset_tx(ctx);
    smbus_set_ack(ctx);
}

void SMBusSlave_CoreOnStopOrRestart(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    smbus_process_stop_or_restart(ctx, status);
    smbus_set_ack(ctx);
}

uint8_t SMBusSlave_CoreOnAddressRead(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    if ((ctx->pending_read != 0U) || (ctx->rx_length > 0U))
    {
        if (ctx->command_length_without_pec == 0U)
        {
            ctx->command_length_without_pec = ctx->rx_length;
        }
        smbus_prepare_read_response(ctx, status);
    }
    else
    {
        smbus_prepare_receive_byte_response(ctx);
    }

    smbus_set_ack(ctx);
    return smbus_load_next_tx_byte(ctx);
}

uint8_t SMBusSlave_CoreOnTransmitAck(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    smbus_set_ack(ctx);
    return smbus_load_next_tx_byte(ctx);
}

void SMBusSlave_CoreOnTransmitDone(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    smbus_reset_rx(ctx);
    smbus_reset_tx(ctx);
    smbus_set_ack(ctx);
}

void SMBusSlave_CoreOnTimeout(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    ctx->timeout_count = (uint8_t)(ctx->timeout_count + 1U);
    ctx->recover_pending = 1U;
    ctx->status_word = (uint16_t)(ctx->status_word | SMBUS_STATUS_WORD_CML);
    smbus_set_event(ctx, SMBUS_EVENT_TIMEOUT, 0U, status);
    smbus_reset_rx(ctx);
    smbus_reset_tx(ctx);
    smbus_set_ack(ctx);
}

void SMBusSlave_CoreOnBusError(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    ctx->recover_pending = 1U;
    ctx->status_word = (uint16_t)(ctx->status_word | SMBUS_STATUS_WORD_CML);
    smbus_set_event(ctx, SMBUS_EVENT_BUS_ERROR, 0U, status);
    smbus_reset_rx(ctx);
    smbus_reset_tx(ctx);
    smbus_set_ack(ctx);
}

void SMBusSlave_CoreOnIgnoredTimeout(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    smbus_set_ack(ctx);
}

uint8_t SMBusSlave_CoreGetAck(const SMBUS_SLAVE_CONTEXT_T *ctx)
{
    return ctx->ack_next;
}

void SMBusSlave_CoreTakeEvents(SMBUS_SLAVE_CONTEXT_T *ctx, SMBUS_SLAVE_EVENT_SNAPSHOT_T *snapshot)
{
    uint8_t next_tail;
#if SMBUS_DEBUG_ENABLE
    SMBUS_DEBUG_RX_FRAME_T *rx_record;
    SMBUS_DEBUG_TX_FRAME_T *tx_record;
    uint8_t index;
#endif

