released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
    snapshot->events = ctx->event_flags;
    snapshot->command = ctx->last_event_command;
    snapshot->status = ctx->last_event_status;
    snapshot->write_done_command = 0U;
    snapshot->write_done_status = 0U;
    snapshot->write_done_dropped = ctx->write_done_dropped;
    ctx->write_done_dropped = 0U;
    if (ctx->write_done_count != 0U)
    {
        snapshot->write_done_command = ctx->write_done_command_queue[ctx->write_done_tail];
        snapshot->write_done_status = ctx->write_done_status_queue[ctx->write_done_tail];

        next_tail = (uint8_t)(ctx->write_done_tail + 1U);
        if (next_tail >= SMBUS_WRITE_DONE_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->write_done_tail = next_tail;
        ctx->write_done_count = (uint8_t)(ctx->write_done_count - 1U);
        snapshot->events = (uint8_t)(snapshot->events | SMBUS_EVENT_WRITE_DONE);
    }
    else
    {
        snapshot->events = (uint8_t)(snapshot->events & ((uint8_t)~SMBUS_EVENT_WRITE_DONE));
    }
    snapshot->timeout_count = ctx->timeout_count;
    snapshot->recover_pending = ctx->recover_pending;
#if SMBUS_DEBUG_ENABLE
    snapshot->debug_rx_command = 0U;
    snapshot->debug_rx_profile = SMBUS_SLAVE_COMMAND_PROFILE_GENERIC;
    snapshot->debug_rx_raw_length = 0U;
    snapshot->debug_rx_payload_length = 0U;
    snapshot->debug_rx_protocol = 0U;
    snapshot->debug_rx_repeated_start = 0U;
    snapshot->debug_rx_pec_present = 0U;
    snapshot->debug_rx_pec_valid = 0U;
    snapshot->debug_rx_dropped = ctx->debug_rx_dropped;
    ctx->debug_rx_dropped = 0U;
    if (ctx->debug_rx_count != 0U)
    {
        rx_record = &ctx->debug_rx_queue[ctx->debug_rx_tail];
        snapshot->debug_rx_command = rx_record->command;
        snapshot->debug_rx_profile = rx_record->profile;
        snapshot->debug_rx_raw_length = rx_record->raw_length;
        if (snapshot->debug_rx_raw_length > SMBUS_SLAVE_RX_BUFFER_SIZE)
        {
            snapshot->debug_rx_raw_length = SMBUS_SLAVE_RX_BUFFER_SIZE;
        }
        snapshot->debug_rx_payload_length = rx_record->payload_length;
        snapshot->debug_rx_protocol = rx_record->protocol;
        snapshot->debug_rx_repeated_start = rx_record->repeated_start;
        snapshot->debug_rx_pec_present = rx_record->pec_present;
        snapshot->debug_rx_pec_valid = rx_record->pec_valid;
        for (index = 0U; index < snapshot->debug_rx_raw_length; index++)
        {
            snapshot->debug_rx_raw[index] = rx_record->raw[index];
        }

        next_tail = (uint8_t)(ctx->debug_rx_tail + 1U);
        if (next_tail >= SMBUS_DEBUG_FRAME_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->debug_rx_tail = next_tail;
        ctx->debug_rx_count = (uint8_t)(ctx->debug_rx_count - 1U);
        snapshot->events = (uint8_t)(snapshot->events | SMBUS_EVENT_DEBUG_RX);
    }
    else
    {
        snapshot->events = (uint8_t)(snapshot->events & ((uint8_t)~SMBUS_EVENT_DEBUG_RX));
    }

    snapshot->debug_tx_command = 0U;
    snapshot->debug_tx_profile = SMBUS_SLAVE_COMMAND_PROFILE_GENERIC;
    snapshot->debug_tx_protocol = 0U;
    snapshot->debug_tx_length = 0U;
    snapshot->debug_tx_dropped = ctx->debug_tx_dropped;
    ctx->debug_tx_dropped = 0U;
    if (ctx->debug_tx_count != 0U)
    {
        tx_record = &ctx->debug_tx_queue[ctx->debug_tx_tail];
        snapshot->debug_tx_command = tx_record->command;
        snapshot->debug_tx_profile = tx_record->profile;
        snapshot->debug_tx_protocol = tx_record->protocol;
        snapshot->debug_tx_length = tx_record->length;
        if (snapshot->debug_tx_length > SMBUS_SLAVE_TX_BUFFER_SIZE)
        {
            snapshot->debug_tx_length = SMBUS_SLAVE_TX_BUFFER_SIZE;
        }
        for (index = 0U; index < snapshot->debug_tx_length; index++)
        {
            snapshot->debug_tx_raw[index] = tx_record->raw[index];
        }

        next_tail = (uint8_t)(ctx->debug_tx_tail + 1U);
        if (next_tail >= SMBUS_DEBUG_TX_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->debug_tx_tail = next_tail;
        ctx->debug_tx_count = (uint8_t)(ctx->debug_tx_count - 1U);
        snapshot->events = (uint8_t)(snapshot->events | SMBUS_EVENT_DEBUG_TX);
    }
    else
    {
        snapshot->events = (uint8_t)(snapshot->events & ((uint8_t)~SMBUS_EVENT_DEBUG_TX));
    }
#endif
    ctx->event_flags = 0U;
#if SMBUS_DEBUG_ENABLE
    if (ctx->debug_rx_count != 0U)
    {
        ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_DEBUG_RX);
    }
    if (ctx->debug_tx_count != 0U)
    {
        ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_DEBUG_TX);
    }
#endif
    if (ctx->write_done_count != 0U)
    {
        ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_WRITE_DONE);
    }
    ctx->recover_pending = 0U;
}

void SMBusSlave_CoreSetRecovered(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    smbus_set_event(ctx, SMBUS_EVENT_RECOVERED, 0U, 0U);
}

void SMBusSlave_CorePrintEvents(uint8_t port_id, const SMBUS_SLAVE_EVENT_SNAPSHOT_T *snapshot)
{
    const char *port_name;
#if SMBUS_DEBUG_ENABLE
    const char *command_name;
    const char *protocol_name;
#endif

    port_name = smbus_get_port_name_from_id(port_id);

#if SMBUS_DEBUG_ENABLE && SMBUS_DEBUG_PRINT_RX_FRAME
    if ((snapshot->events & SMBUS_EVENT_DEBUG_RX) != 0U)
    {
        command_name = smbus_debug_get_command_name(snapshot->debug_rx_profile, snapshot->debug_rx_command);
        protocol_name = smbus_debug_get_protocol_name(snapshot->debug_rx_protocol);
        printf("SMBus RX cmd=0x%02X ", (unsigned int)snapshot->debug_rx_command);
        printf("(%s) ", command_name);
        printf("bus=%s\r\n", port_name);
        printf("SMBus RX info raw=%u payload=%u proto=%u\r\n",
               (unsigned int)snapshot->debug_rx_raw_length,
               (unsigned int)snapshot->debug_rx_payload_length,
               (unsigned int)snapshot->debug_rx_protocol);
        printf("SMBus RX pec rs=%u pec=%u valid=%u\r\n",
               (unsigned int)snapshot->debug_rx_repeated_start,
               (unsigned int)snapshot->debug_rx_pec_present,
               (unsigned int)snapshot->debug_rx_pec_valid);
        printf("SMBus RX raw=");
        smbus_debug_print_raw_bytes(snapshot->debug_rx_raw, snapshot->debug_rx_raw_length);
        printf(" proto=%s bus=%s\r\n", protocol_name, port_name);
    }
#endif

#if SMBUS_DEBUG_ENABLE && SMBUS_DEBUG_PRINT_TX_READY
    if ((snapshot->events & SMBUS_EVENT_DEBUG_TX) != 0U)
    {
        command_name = smbus_debug_get_command_name(snapshot->debug_tx_profile, snapshot->debug_tx_command);
        protocol_name = smbus_debug_get_protocol_name(snapshot->debug_tx_protocol);
        printf("SMBus TX cmd=0x%02X ", (unsigned int)snapshot->debug_tx_command);
        printf("(%s) ", command_name);
        printf("proto=%u ", (unsigned int)snapshot->debug_tx_protocol);
        printf("(%s) ", protocol_name);
        printf("len=%u ", (unsigned int)snapshot->debug_tx_length);
        printf("bus=%s raw=", port_name);
        smbus_debug_print_raw_bytes(snapshot->debug_tx_raw, snapshot->debug_tx_length);
        printf("\r\n");
    }
#endif

#if SMBUS_DEBUG_ENABLE
    if (snapshot->debug_rx_dropped != 0U)
    {
        printf("[SMBus %s] RX debug log dropped=%u\r\n",
               port_name,
               (unsigned int)snapshot->debug_rx_dropped);
    }
    if (snapshot->debug_tx_dropped != 0U)
    {
        printf("[SMBus %s] TX debug log dropped=%u\r\n",
               port_name,
               (unsigned int)snapshot->debug_tx_dropped);
    }
#endif
    if (snapshot->write_done_dropped != 0U)
    {
        printf("[SMBus %s] write done log dropped=%u\r\n",
               port_name,
               (unsigned int)snapshot->write_done_dropped);
    }

